app/controllers/students_controller.rb

  def update
    set_student
    @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-08-12 17:24:31.733787"], ["id", 1]]